FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    BaseType_t xReturn = pdFAIL;

    if( xPhyObject.ulLinkStatusMask != 0U )
    {
        xReturn = pdPASS;
    }

    return xReturn;
}

/*-----------------------------------------------------------*/

static BaseType_t xSTM32_NetworkInterfaceInitialise( NetworkInterface_t * pxInterface )
{
    BaseType_t xInitResult = pdFAIL;
    BaseType_t xResult;
    HAL_StatusTypeDef xHalResult;

    static eMAC_INIT_STATUS_TYPE xMacInitStatus = eMacEthInit;

    switch( xMacInitStatus )
    {
        default:
            configASSERT( pdFALSE );
            break;

        case eMacEthInit:
            xEthHandle.Instance = ETH;

            NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
            if( pxEndPoint == NULL )
            {
                break;
            }

            xEthHandle.Init.MACAddr = ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes;
            xEthHandle.Init.MediaInterface = HAL_ETH_RMII_MODE;
            xEthHandle.Init.TxDesc = DMATxDscrTab;
            xEthHandle.Init.RxDesc = DMARxDscrTab;
            xEthHandle.Init.RxBuffLen = EMAC_DATA_BUFFER_SIZE;

            ( void ) memset( &DMATxDscrTab, 0, sizeof( DMATxDscrTab ) );
            ( void ) memset( &DMARxDscrTab, 0, sizeof( DMARxDscrTab ) );

            #if defined( STM32F7 ) || defined( STM32F4 )
                /* This function doesn't get called in Fxx driver */
                HAL_ETH_SetMDIOClockRange( &xEthHandle );
            #endif

            xHalResult = HAL_ETH_Init( &xEthHandle );
            if( xHalResult != HAL_OK )
            {
                /* &xEthHandle != NULL
                xEthHandle.ErrorCode == HAL_ETH_ERROR_TIMEOUT */
                break;
            }
            configASSERT( xEthHandle.ErrorCode == HAL_ETH_ERROR_NONE );
            configASSERT( xEthHandle.gState == HAL_ETH_STATE_READY );

            #if 0
                ETH_MACFilterConfigTypeDef xFilterConfig;
                xHalResult = HAL_ETH_GetMACFilterConfig( &xEthHandle, &xFilterConfig );
                configASSERT( xHalResult == HAL_OK );

                xFilterConfig.HashUnicast = ENABLE;
                xFilterConfig.HashMulticast = ENABLE;
                xHalResult = HAL_ETH_SetMACFilterConfig( &xEthHandle, &xFilterConfig );
                configASSERT( xHalResult == HAL_OK );

                const uint32_t ulHashTable = 0x00;
                xHalResult = HAL_ETH_SetHashTable( &xEthHandle, &ulHashTable );
                configASSERT( xHalResult == HAL_OK );
            #endif

            #if ( ipconfigUSE_MDNS != 0 )
                prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xMDNS_MACAddress.ucBytes );
                #if ( ipconfigUSE_IPv6 != 0 )
                    prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xMDNS_MACAddressIPv6.ucBytes );
                #endif
            #endif

            #if ( ipconfigUSE_LLMNR != 0 )
                prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xLLMNR_MACAddress.ucBytes );
                #if ( ipconfigUSE_IPv6 != 0 )
                    prvMACAddressConfig( &xEthHandle, ( uint8_t * ) xLLMNR_MacAddressIPv6.ucBytes );
                #endif
            #endif

            for(; pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
            {
                #if ( ipconfigUSE_IPv6 != 0 )
                    if( pxEndPoint->bits.bIPv6 != pdFALSE_UNSIGNED )
                    {
                        const uint8_t ucMACAddress[ ipMAC_ADDRESS_LENGTH_BYTES ] = {
                            0x33,
                            0x33,
                            0xff,
                            pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 13 ],
                            pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 14 ],
                            pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ 15 ]
                        };
                        prvMACAddressConfig( &xEthHandle, ucMACAddress );
                    }
                #else
                {
                    if( xEthHandle.Init.MACAddr != ( uint8_t * ) pxEndPoint->xMACAddress.ucBytes )
                    {
                        prvMACAddressConfig( &xEthHandle, pxEndPoint->xMACAddress.ucBytes );
                    }
                }
                #endif
            }

            #if ( ipconfigUSE_IPv6 != 0 )
                const uint8_t ucMACAddress[ ipMAC_ADDRESS_LENGTH_BYTES ] = { 0x33, 0x33, 0, 0, 0, 0x01 };
                prvMACAddressConfig( &xEthHandle, ucMACAddress );
            #endif

            xMacInitStatus = eMacPhyInit;
            /* fallthrough */

        case eMacPhyInit:
            vPhyInitialise( &xPhyObject, ( xApplicationPhyReadHook_t ) prvPhyReadReg, ( xApplicationPhyWriteHook_t ) prvPhyWriteReg );

            xResult = xPhyDiscover( &xPhyObject );
            if( xResult == 0 )
            {
                break;
            }

            xMacInitStatus = eMacPhyStart;
            /* fallthrough */

        case eMacPhyStart:
            xResult = xPhyConfigure( &xPhyObject, &xPHYProperties );
            if( xResult != 0 )
            {
                break;
            }

            if ( xSTM32_GetPhyLinkStatus( pxInterface ) == pdFAIL )
            {
                xResult = xPhyStartAutoNegotiation( &xPhyObject, xPhyGetMask( &xPhyObject ) );
                /* TODO: xPhyStartAutoNegotiation always returns 0, Should return -1 if xPhyGetMask == 0 ? */
                configASSERT( xResult == 0 );
                if ( xSTM32_GetPhyLinkStatus( pxInterface ) == pdFAIL )
                {
                    break;
                }
            }

            ETH_MACConfigTypeDef xMACConfig;
            xHalResult = HAL_ETH_GetMACConfig( &xEthHandle , &xMACConfig );
            configASSERT( xHalResult == HAL_OK );
            if( xHalResult != HAL_OK )
            {
                break;
            }
            xMACConfig.DuplexMode = ( xPhyObject.xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
            xMACConfig.Speed = ( xPhyObject.xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
            xMACConfig.ChecksumOffload = ( FunctionalState ) ( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM != 0 );
            xHalResult = HAL_ETH_SetMACConfig( &xEthHandle, &xMACConfig );
            configASSERT( xHalResult == HAL_OK );
            if( xHalResult != HAL_OK )
            {
                break;
            }

