FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
static UBaseType_t prvNetworkInterfaceInput( void )
{
    UBaseType_t xResult = 0;
    #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
        NetworkBufferDescriptor_t * pxStartDescriptor = NULL;
        NetworkBufferDescriptor_t * pxEndDescriptor = NULL;
    #endif
    NetworkBufferDescriptor_t * pxCurDescriptor = NULL;

    while ( ( HAL_ETH_ReadData( &xEthHandle, ( void ** ) &pxCurDescriptor ) == HAL_OK ) )
    {
        /* configASSERT( xEthHandle.RxDescList.RxDataLength <= EMAC_DATA_BUFFER_SIZE ); */
        if( pxCurDescriptor == NULL )
        {
            /* Buffer was dropped, ignore packet */
            continue;
        }
        iptraceNETWORK_INTERFACE_INPUT( pxCurDescriptor->xDataLength, pxCurDescriptor->pucEthernetBuffer );
        ++xResult;
        pxCurDescriptor->pxInterface = pxMyInterface;
        pxCurDescriptor->pxEndPoint = FreeRTOS_MatchingEndpoint( pxCurDescriptor->pxInterface, pxCurDescriptor->pucEthernetBuffer );
        #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
            if ( pxStartDescriptor == NULL )
            {
                pxStartDescriptor = pxCurDescriptor;
            }
            else if ( pxEndDescriptor != NULL )
            {
                pxEndDescriptor->pxNextBuffer = pxCurDescriptor;
            }
            pxEndDescriptor = pxCurDescriptor;
        #else
            xRxEvent.pvData = ( void * ) pxCurDescriptor;
            if( xSendEventStructToIPTask( &xRxEvent, ( TickType_t ) 20U ) != pdPASS )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInput: xSendEventStructToIPTask failed\n" ) );
                vReleaseNetworkBufferAndDescriptor( pxCurDescriptor );
            }
        #endif
    }

    #if ( ipconfigUSE_LINKED_RX_MESSAGES != 0 )
        if( xResult > 0 )
        {
            const IPStackEvent_t xRxEvent = {
                .eEventType = eNetworkRxEvent,
                .pvData = ( void * ) pxStartDescriptor,
            };
            if( xSendEventStructToIPTask( &xRxEvent, ( TickType_t ) 100U ) != pdPASS )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvNetworkInterfaceInput: xSendEventStructToIPTask failed\n" ) );
                NetworkBufferDescriptor_t * pxDescriptorToClear = pxStartDescriptor;
                do {
                    NetworkBufferDescriptor_t * pxNext = pxDescriptorToClear->pxNextBuffer;
                    vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
                    pxDescriptorToClear = pxNext;
                } while( pxDescriptorToClear != NULL );
            }
        }
    #endif

    if( xResult == 0 )
    {
        ( void ) xTaskNotify( xEMACTaskHandle, eMacEventErrRx, eSetBits );
    }

    configASSERT( xEthHandle.ErrorCode != HAL_ETH_ERROR_PARAM );
    if( xEthHandle.gState != HAL_ETH_STATE_STARTED )
    {
        ( void ) xTaskNotify( xEMACTaskHandle, eMacEventErrEth, eSetBits );
    }

    return ( BaseType_t ) ( xResult > 0 );
}

/*-----------------------------------------------------------*/

static void prvEMACHandlerTask( void * pvParameters )
{
    ( void ) pvParameters;

    for( ;; )
    {
        BaseType_t xResult = 0U;
        uint32_t ulISREvents = 0U;

        if ( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( 100UL ) ) == pdTRUE )
        {
            HAL_StatusTypeDef xHalResult;

            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = ( prvNetworkInterfaceInput() > 0 );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 1000U ) ) != pdFALSE )
                {
                    xHalResult = HAL_ETH_ReleaseTxPacket( &xEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    ( void ) xSemaphoreGive( xTxMutex );
                }
            }
            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 1000U ) ) != pdFALSE )
                {
                    xHalResult = HAL_ETH_ReleaseTxPacket( &xEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    while( ETH_TX_DESC_CNT - uxQueueMessagesWaiting( ( QueueHandle_t ) xTxDescSem ) > xEthHandle.TxDescList.BuffersInUse )
                    {
                        ( void ) xSemaphoreGive( xTxDescSem );
                    }
                }
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
                /*do {
                    xResult = ( prvNetworkInterfaceInput() > 0 );
                } while ( xResult != pdFALSE );
                xResult = pdTRUE;*/
            }

            if( ( ulISREvents & eMacEventErrEth ) != 0 )
            {
                /* xEthHandle.gState */
                /* xEthHandle.ErrorCode */
            }

            if( ( ulISREvents & eMacEventErrMac ) != 0 )
            {
                /* xEthHandle.MACErrorCode */
            }

            if( ( ulISREvents & eMacEventErrDma ) != 0 )
            {
                /* TODO: Does this recover from fatal bus error? */
                if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( 5000U ) ) != pdFALSE )
                {
                    /* xEthHandle.DMAErrorCode */
                    xEthHandle.gState = HAL_ETH_STATE_STARTED;
                    xHalResult = HAL_ETH_Stop_IT( &xEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( xEthHandle.gState == HAL_ETH_STATE_READY );
                    configASSERT( xEthHandle.RxDescList.ItMode == 0U);
                    xHalResult = HAL_ETH_DeInit( &xEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( xEthHandle.gState == HAL_ETH_STATE_RESET );
                    xHalResult = HAL_ETH_Init( &xEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( xEthHandle.ErrorCode == HAL_ETH_ERROR_NONE );
                    configASSERT( xEthHandle.gState == HAL_ETH_STATE_READY );
                    xHalResult = HAL_ETH_Start_IT( &xEthHandle );
                    configASSERT( xHalResult == HAL_OK );
                    configASSERT( xEthHandle.gState == HAL_ETH_STATE_STARTED );
                    configASSERT( xEthHandle.RxDescList.ItMode == 1U);
                    xSemaphoreGive( xTxMutex );
                }
            }

            (void) xHalResult;
        }

        if( xPhyCheckLinkStatus( &xPhyObject, xResult ) != pdFALSE )
        {
            if( xEthHandle.gState != HAL_ETH_STATE_BUSY )
            {
                prvEthernetUpdateConfig();
            }
        }
    }
}

/*-----------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor )
{
    BaseType_t xResult = pdFALSE;

    uint32_t pErrorCode = 0;
    const HAL_StatusTypeDef xHalResult = HAL_ETH_GetRxDataErrorCode( &xEthHandle, &pErrorCode );
    configASSERT( xHalResult == HAL_OK );
    (void) xHalResult;

    /* Fxx - ETH_DMARXDESC_DBE | ETH_DMARXDESC_RE | ETH_DMARXDESC_OE  | ETH_DMARXDESC_RWT | ETH_DMARXDESC_LC | ETH_DMARXDESC_CE | ETH_DMARXDESC_DE | ETH_DMARXDESC_IPV4HCE */
    /* Hxx - ETH_DMARXNDESCWBF_DE | ETH_DMARXNDESCWBF_RE | ETH_DMARXNDESCWBF_OE | ETH_DMARXNDESCWBF_RWT | ETH_DMARXNDESCWBF_GP | ETH_DMARXNDESCWBF_CE */

    if ( pErrorCode == 0 )
    {
        // ipconfigETHERNET_DRIVER_FILTERS_PACKETS
        const eFrameProcessingResult_t xFrameProcessingResult = ipCONSIDER_FRAME_FOR_PROCESSING( pxDescriptor->pucEthernetBuffer );
        if( xFrameProcessingResult == eProcessBuffer )
        {
            xResult = pdTRUE;
        }
        else
        {
            /* Other Enum Values Are Invalid */
            configASSERT( xFrameProcessingResult == eReleaseBuffer );
        }
    }

    return xResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue )
{
    BaseType_t xResult = -1;
    if( HAL_ETH_ReadPHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, pulValue ) == HAL_OK )
    {
        xResult = 0;
    }
    return xResult;
}

/*-----------------------------------------------------------*/

static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue )
{
    BaseType_t xResult = -1;
    if( HAL_ETH_WritePHYRegister( &xEthHandle, ( uint32_t ) xAddress, ( uint32_t ) xRegister, ulValue ) == HAL_OK )
    {
        xResult = 0;
    }
    return xResult;
}

/*-----------------------------------------------------------*/

static void prvEthernetUpdateConfig( void )
{
    BaseType_t xResult;
    HAL_StatusTypeDef xHalResult;

    if( xSTM32_GetPhyLinkStatus( pxMyInterface ) != pdFAIL )
    {
        xResult = xPhyStartAutoNegotiation( &xPhyObject, xPhyGetMask( &xPhyObject ) );
        configASSERT( xResult == 0 );

        ETH_MACConfigTypeDef xMACConfig;
        xHalResult = HAL_ETH_GetMACConfig( &xEthHandle , &xMACConfig );
        configASSERT( xHalResult == HAL_OK );

